Soft-Services/Leonhart/sysconfig/Leonhart.syscfg
UART3.$assignVoltage               = "3.3 V";
UART3.CTSn.$assign                 = "OSPI0_DQS";
UART3.DCDn.$used                   = false;
UART3.DSRn.$used                   = false;
UART3.DTRn.$used                   = false;
UART3.RIn.$used                    = false;
UART3.RTSn.$assign                 = "OSPI0_LBCLKO";
UART3.RXD.$assign                  = "OSPI0_CSn2";
UART3.TXD.$assign                  = "OSPI0_CSn3";
const USB1                         = scripting.addPeripheral("USB");
USB1.$name                         = "USB C";
USB1.$assign                       = "USB0";
USB1.DM.$assign                    = "USB0_DM";
USB1.DP.$assign                    = "USB0_DP";
USB1.DRVVBUS.$used                 = false;
USB1.RCALIB.$assign                = "USB0_RCALIB";
USB1.VBUS.$assign                  = "USB0_VBUS";
const USB2                         = scripting.addPeripheral("USB");
USB2.$name                         = "USB A";
USB2.$assign                       = "USB1";
USB2.DM.$assign                    = "USB1_DM";
USB2.DP.$assign                    = "USB1_DP";
USB2.DRVVBUS.$assign               = "USB1_DRVVBUS";
USB2.RCALIB.$assign                = "USB1_RCALIB";
USB2.VBUS.$assign                  = "USB1_VBUS";
scripting.suppress("Voltage conflict,VDDSHV0 is set to 3\\.3 V", USB2, "DRVVBUS");
const WKUP_LFOSC1                  = scripting.addPeripheral("WKUP_LFOSC");
WKUP_LFOSC1.$name                  = "WKUP_LFOSC1";
WKUP_LFOSC1.XI.$assign             = "WKUP_LFOSC0_XI";
WKUP_LFOSC1.XO.$assign             = "WKUP_LFOSC0_XO";
const WKUP_SYSTEM1                 = scripting.addPeripheral("WKUP_SYSTEM");
WKUP_SYSTEM1.$name                 = "WKUP_SYSTEM";
WKUP_SYSTEM1.WKUP_CLKOUT0.$used    = false;
WKUP_SYSTEM1.PMIC_LPM_EN0.pu_pd    = "pu";
WKUP_SYSTEM1.PMIC_LPM_EN0.$assign  = "PMIC_LPM_EN0";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
DDRSS1.$suggestSolution             = "DDR0";
DDRSS1.A0.$suggestSolution          = "DDR0_A0";
DDRSS1.A1.$suggestSolution          = "DDR0_A1";
DDRSS1.A10.$suggestSolution         = "DDR0_A10";
DDRSS1.A11.$suggestSolution         = "DDR0_A11";
DDRSS1.A12.$suggestSolution         = "DDR0_A12";
DDRSS1.A13.$suggestSolution         = "DDR0_A13";
DDRSS1.A2.$suggestSolution          = "DDR0_A2";
DDRSS1.A3.$suggestSolution          = "DDR0_A3";
DDRSS1.A4.$suggestSolution          = "DDR0_A4";
DDRSS1.A5.$suggestSolution          = "DDR0_A5";
DDRSS1.A6.$suggestSolution          = "DDR0_A6";
DDRSS1.A7.$suggestSolution          = "DDR0_A7";
DDRSS1.A8.$suggestSolution          = "DDR0_A8";
DDRSS1.A9.$suggestSolution          = "DDR0_A9";
DDRSS1.ACT_n.$suggestSolution       = "DDR0_ACT_n";
DDRSS1.ALERT_n.$suggestSolution     = "DDR0_ALERT_n";
DDRSS1.BA0.$suggestSolution         = "DDR0_BA0";
DDRSS1.BA1.$suggestSolution         = "DDR0_BA1";
DDRSS1.BG0.$suggestSolution         = "DDR0_BG0";
DDRSS1.BG1.$suggestSolution         = "DDR0_BG1";
DDRSS1.CAS_n.$suggestSolution       = "DDR0_CAS_n";
DDRSS1.CK0.$suggestSolution         = "DDR0_CK0";
DDRSS1.CK0_n.$suggestSolution       = "DDR0_CK0_n";
DDRSS1.CKE0.$suggestSolution        = "DDR0_CKE0";
DDRSS1.CKE1.$suggestSolution        = "DDR0_CKE1";
DDRSS1.CS0_n.$suggestSolution       = "DDR0_CS0_n";
DDRSS1.CS1_n.$suggestSolution       = "DDR0_CS1_n";
DDRSS1.DM0.$suggestSolution         = "DDR0_DM0";
DDRSS1.DM1.$suggestSolution         = "DDR0_DM1";
DDRSS1.DQ0.$suggestSolution         = "DDR0_DQ0";
DDRSS1.DQ1.$suggestSolution         = "DDR0_DQ1";
DDRSS1.DQ10.$suggestSolution        = "DDR0_DQ10";
DDRSS1.DQ11.$suggestSolution        = "DDR0_DQ11";
DDRSS1.DQ12.$suggestSolution        = "DDR0_DQ12";
DDRSS1.DQ13.$suggestSolution        = "DDR0_DQ13";
DDRSS1.DQ14.$suggestSolution        = "DDR0_DQ14";
DDRSS1.DQ15.$suggestSolution        = "DDR0_DQ15";
DDRSS1.DQ2.$suggestSolution         = "DDR0_DQ2";
DDRSS1.DQ3.$suggestSolution         = "DDR0_DQ3";
DDRSS1.DQ4.$suggestSolution         = "DDR0_DQ4";
DDRSS1.DQ5.$suggestSolution         = "DDR0_DQ5";
DDRSS1.DQ6.$suggestSolution         = "DDR0_DQ6";
DDRSS1.DQ7.$suggestSolution         = "DDR0_DQ7";
DDRSS1.DQ8.$suggestSolution         = "DDR0_DQ8";
DDRSS1.DQ9.$suggestSolution         = "DDR0_DQ9";
DDRSS1.DQS0.$suggestSolution        = "DDR0_DQS0";
DDRSS1.DQS0_n.$suggestSolution      = "DDR0_DQS0_n";
DDRSS1.DQS1.$suggestSolution        = "DDR0_DQS1";
DDRSS1.DQS1_n.$suggestSolution      = "DDR0_DQS1_n";
DDRSS1.ODT0.$suggestSolution        = "DDR0_ODT0";
DDRSS1.ODT1.$suggestSolution        = "DDR0_ODT1";
DDRSS1.PAR.$suggestSolution         = "DDR0_PAR";
DDRSS1.RAS_n.$suggestSolution       = "DDR0_RAS_n";
DDRSS1.RESET0_n.$suggestSolution    = "DDR0_RESET0_n";
DDRSS1.WE_n.$suggestSolution        = "DDR0_WE_n";
DDRSS1.CAL0.$suggestSolution        = "DDR0_CAL0";
GPIO1["11"].$suggestSolution        = "OSPI0_CSn0";
GPIO1["12"].$suggestSolution        = "OSPI0_CSn1";
GPIO1.$suggestSolution              = "GPIO0";
JTAG1.$suggestSolution              = "MCU_DEBUG0";
MCU_OSC1.$suggestSolution           = "MCU_OSC0";
MCU_SYSTEM1.$suggestSolution        = "MCU_SYSTEM0";
MMC01.$suggestSolution              = "MMC0";
MMC11.$suggestSolution              = "MMC1";
RGMII1.$suggestSolution             = "RGMII1";
SYSTEM1.$suggestSolution            = "SYSTEM0";
SYSTEM1.EXTINTn.$suggestSolution    = "EXTINTn";
SYSTEM1.PORz_OUT.$suggestSolution   = "PORz_OUT";
SYSTEM1.RESETSTATz.$suggestSolution = "RESETSTATz";
SYSTEM1.RESET_REQz.$suggestSolution = "RESET_REQz";
WKUP_LFOSC1.$suggestSolution        = "WKUP_LFOSC0";
WKUP_SYSTEM1.$suggestSolution       = "WKUP_SYSTEM";
